<!DOCTYPE html>
<html>
  <head>
		<?include 'headerHtml.php'?>
		<style>
		</style>
		<script language="javascript">
  <!-- 
	function show(elemId){
		
     	   if(document.getElementById(elemId).style.display =='none'){
	  		 document.getElementById(elemId).style.display='block'
			  
		   }
		   else{
 	  		 document.getElementById(elemId).style.display='none'
			
		   }   
}

//-->
			</script>
  </head>
  <body>
	<div class="container">

		<div class="row" style='background-image:url("images/cover pictures-03.jpg");background-size:cover; height:400px; position:relative'>
		<?include 'header.php'?>
		</div>

		<div class="row">

			<div class="col-sm-12">

				<hr style='border-color:#f4b426; background-color:#f4b426; width:20%'>
				<h3>MUSICOLAB</h3>
				ΑΡΧΙΚΗ / <font color='#f4b426'>ΝΕΑ</font><br>
				<br>
				<hr style='border-color:#f4b426; background-color:#f4b426; width:20%'>
				
				<br>

				<h4><a href="#news-1" onClick="onClick="show('news-1')>Πρόσκληση εκδήλωσης ενδιαφέροντος για αμειβόμενες θέσεις νέων ερευνητών </h4>

<div id="news-1">
				Η ομάδας του έργου από το Ελληνικό Μεσογειακό Πανπιστήμιο, αναζητεί να προσλάβει μικρό πλήθος νέων ερευνητών που να είναι απόφοιτοι Τμημάτων με αντικείμενο συναφές με τις τεχνολογίες της Πληροφορικής, της Μουσικής, του Ήχου ή/και της Εικόνας. Υποψήφιοι μπορούν επίσης  να είναι μεταπτυχιακοί φοιτητές ή κάτοχοι Μεταπτυχιακού Διπλώματος Ειδίκευσης (ΜΔΕ) συναφές με τα παραπάνω αντικείμενα.
Αντικείμενο απασχόλησης
Αντικείμενο της θέσης είναι η εφαρμοσμένη έρευνα σε συστήματα υποστήριξης μουσικής μάθησης μέσω Διαδικτύου και ειδικότερα η διερεύνηση των λειτουργικών απαιτήσεων των συμμετεχόντων σε μια συνεδρία μουσικής εκπαίδευσης, η υλοποίησή τους με τεχνολογίες ανοιχτού κώδικα, καθώς και η συγγραφή ερευνητικών και τεχνικών αναφορών.
<h5>Ερευνητικά πεδία δραστηριότητας:</h5>
<ul>
<li>Δικτυακή Μουσική Εκτέλεση</li>
<li>Τεχνολογίες Υποστήριξης Μάθησης</li>
<li> Ψηφιακή Τεκμηρίωση Μουσικού Περιεχομένου</li>
</ul>
<h5>Επιθυμητά προσόντα υποψηφίων</h5>
<ul>
<li>Πτυχίο ή/και ΜΔΕ σε αντικείμενα συναφή με τεχνολογίες Πληροφορικής, Μουσικής, Ήχου, Εικόνας</li>
<li>Ενδιαφέρον για τη συνέχιση σπουδών σε Μεταπτυχιακό ή/και Διδακτορικό Επίπεδο</li>
<li>Ενδιαφέρον στη διερεύνηση νέων τεχνολογιών και εργαλείων λογισμικού</li>
<li>Καλή γνώση Τεχνολογιών Πληροφορικής και Επικοινωνιών</li>
<li>Στοιχειώδη γνώση μουσικής σημειογραφίας</li>
<li>Καλή γνώση της Αγγλικής Γλώσσας</li>
<li>Ικανότητα στο γραπτό λόγο</li>

</ul>
<h5>Επικοινωνία</h5>
<p>
Οι ενδιαφερόμενοι καλούνται να αποστείλουν το βιογραφικό τους σημείωμα καθώς και μια σύντομη επιστολή (μιας δακτυλογραφημένης σελίδας) που να περιγράφει τα επιστημονικά και επαγγελματικά ενδιαφέροντα του υποψηφίου και με σαφή αναφορά στους λόγους για τους οποίους ο υποψήφιος ενδιαφέρεται για τη συγκεκριμένη θέση.  Τα στοιχεία αυτά να σταλούν το αργότερο έως τη Δευτέρα 25 Οκτωβρίου 2021 ηλεκτρονικά στους επιστημονικούς υπεύθυνους του έργου:
Χρυσούλα Αλεξανδράκη (chrisoula@hmu.gr)
Επίκουρη Καθηγήτρια
Τμήμα Μουσικής Τεχνολογίας και Ακουστικής
Δημοσθένη Ακουμιανάκης (da@hmu.gr )
Καθηγητής
Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών
</p>
</div>
			</div>
		</div>
		<?include 'footer.php'?>
	</div>
  </body>
</html>

